package task4.part4;

//Дана строка-шаблон, содержащая заготовку письма. Например, "Уважаемый, $userName, извещаем вас о том,
//что на вашем счете $номерСчета скопилась сумма, превышающая стоимость $числоМесяцев месяцев пользования
//нашими услугами. Деньги продолжают поступать. Вероятно, вы неправильно настроили автоплатеж. С уважением,
//$пользовательФИО $должностьПользователя"
//Также дана одна пара строк. templateKey и templateValue.
// Необходимо в строке заменить все placeholders (строки $имяШаблона, т.е. &#39;$&#39;
//+ templateKey) на значения из templateValue.

public class AutoRespondMain {
}
